Repository: purinvilla/BPTrackingProject
Catalog: BloodPressureMAUI/Resources/Strings/AppResources.*.resx
Languages: th_th

source: Welcome!
th_th: ยินดีต้อนรับ!

# LoginMessage
source: Login to your account
th_th: กรุณาเข้าระบบเพื่อใช้งาน

# RegisterLabel
source: User Registration
th_th: ลงทะเบียนผู้ใช้งาน

# RegisterMessage
source: Please fill in the information below.
th_th: กรุณากรอกข้อมูล

# DataEntryLabel
source: Enter new data
th_th: ข้อมูลใหม่

# DataEntryMessage
source: Entry for today
th_th: ข้อมูลสำหรับวันนี้

# UsernamePlaceholder
source: Username
th_th: ชื่อผู้ใช้(อีเมล์)

# EmailPlaceholder
source: Email
th_th: อีเมล์

# PasswordPlaceholder
source: Password
th_th: ระหัสผ่าน

source: Confirm Password
th_th: ยืนยันระหัสผ่าน

# SystolicText
source: Systolic Blood Pressure
th_th: ค่าด้านสูง (SYS)

# DiastolicText
source: Diastolic Blood Pressure
th_th: ค่าด้านต่ำ (DIA)

# HeartrateText
source: Heart Rate
th_th: อัตราการเต้นของหัวใจ

# SignInBtn
source: Sign In
th_th: เข้าระบบ

# RegisterBtn
source: Register
th_th: ลงทะเบียน

# BackBtn
source: Go Back
th_th: ย้อนกลับ

# AddDataBtn
source: Add Data
th_th: บันทึกข้อมูล

# ConfirmPasswordFailed
source: Did not correctly confirm password.
th_th: ระหัสผ่านไม่ตรงกัน

source: Data Entry Failed 🥺
th_th: บันทึกข้อมูลมีปัญหา 🥺

# DataEntryFailedMessage
source: Failed to add new blood pressure data.
th_th: ไม่สามารถบันทึกข้อมูลได้

source: Data Entry Success 😃
th_th: การบันทึกข้อมูลสำเร็จ 😃

# DataEntrySuccessMessage
source: New blood pressure data added.
th_th: ข้อมูลใหม่ได้รับการบันทึก

# InvalidCredentials
source: Invalid email or password.
th_th: อีเมล์ หรือ ระหัสผ่าน ไม่ถูกต้อง

source: Login Failed 🥺
th_th: เข้าระบบมีปัญหา 🥺

# LoginFailedMessage
source: Failed to log in to account.
th_th: ไม่สามารถเข้าระบบได้

source: Login Success 😃
th_th: เข้าระบบสำเร็จ 😃

# LoginSuccessMessage
source: Successfully logged in to account.
th_th: เข้าระบบได้เรียบร้อย

# MissingField
source: Missing field detected.
th_th: กรอกข้อมูลไม่ครบ

# OKPrompt
source: OK
th_th: ตกลง

# RegistationSuccessMessage
source: Account successfully registered.
th_th: ลงทะเบียนได้เรียบร้อย

source: Registration Failed 🥺
th_th: ลงทะเบียนไม่ผ่าน 🥺

# RegistrationFailedMessage
source: Failed to register account.
th_th: ลงทะเบียนไม่ผ่าน

source: Registration Success 😃
th_th: ลงทะเบียนสำเร็จ 😃

# LoginTitle
source: Login
th_th: เข้าระบบ

# RegistrationTitle
source: Registration
th_th: ลงทะเบียน

# DataEntryTitle
source: Data Entry
th_th: บันทึกข้อมูล

# DataViewTitle
source: Data View
th_th: ดูข้อมูล

source: Data Not Found 🥺
th_th: ไม่พบข้อมูล 🥺

# DataNotFoundMessage
source: Failed to retrieve data.
th_th: ดึงข้อมูลล้มเหลว

source: Logout Success 😃
th_th: ออกจากระบบสำเร็จ 😃

# LogoutSuccessMessage
source: Successfully logged out of account.
th_th: ออกจากระบบสำเร็จ

# LogoutTitle
source: Logout
th_th: ออกจากระบบ

# AboutAppTitle
source: About App
th_th: เกี่ยวกับโปรแกรม

# DateText
source: Date
th_th: วันที่

# TimeText
source: Time
th_th: เวลา

# HeartText
source: Heart Rate
th_th: หัวใจ

# FromDateText
source: From:
th_th: วันที่:

# ToDateText
source: To:
th_th: ถึง:

source: Delete Success 😃
th_th: ลบข้อมูลสำเร็จ 😃

# DeleteSuccessMessage
source: Data was deleted successfully.
th_th: ลบข้อมูลแล้ว

# DataEditLabel
source: Editing data
th_th: แก้ไขข้อมูล

# DataEditTitle
source: Data Editing
th_th: แก้ไขข้อมูลล้มเหลว

# UpdateDataBtn
source: Update Data
th_th: แก้ไขข้อมูล

source: Update Success 😃
th_th: แก้ไขสำเร็จ 😃

# UpdateSuccessMessage
source: Blood pressure data was updated successfully.
th_th: แก้ไขข้อมูลความดันโลหิตสำเร็จ

source: Update Failed 🥺
th_th: แก้ไขข้อมูลล้มเหลว 🥺

# UpdateFailedMessage
source: Failed to update blood pressure data.
th_th: แก้ไขข้อมูลความดันโลหิตล้มเหลว

# SearchBtn
source: 🔍 Search
th_th: 🔍 ค้นหา

# ResetDateBtn
source: 📅 Reset Date
th_th: 📅 วันที่ปัจจุบัน

source: Save password
th_th: บันทึกระหัสผ่าน

# DataViewFailed
source: Data Retrieval Failed 🥺
th_th: ไม่สามารถดึงข้อมูลได้

# DataViewFailedMessage
source: Failed to retrieve data for viewing.
th_th: ไม่สามารถดึงข้อมูลมาดูได้

source: Settings Saved 😃
th_th: บันทึกเรียบร้อย 😃

# SettingsSavedMessage
source: Your settings were saved successfully.
th_th: การตั้งค่าระบบได้รับการบันทึกเรียบร้อย

# SettingsTitle
source: Settings
th_th: การตั้งค่าระบบ

# APIHostSetting
source: API Host Name
th_th: ชื่อโฮสของ API

# APIHostSettingDesc
source: The location of the REST API.
th_th: ตำแหน่งของ REST API

# SaveBtn
source: Save
th_th: บันทึก

source: Settings Not Saved 🥺
th_th: ไม่สามารถบันทึกได้ 🥺

# DateTotalMax
source: Only 30 days of data can be viewed at a time.
th_th: ตั้งค่าวันเริ่มต้นเป็น 30 วันก่อนหน้า

# AlertSettingLabel
source: Blood Pressure Alarm Values
th_th: แจ้งเตือนค่าความดัน

# PhoneNumberLabel
source: Authorized Phone Numbers
th_th: หมายเลขโทรศัพท์

# SMSMessage
source: Alert!!! for {0}
th_th: คำเตือน!!! สำหรับ {0}

# AlertSettingDesc
source: Sends an SMS whenever new data for blood pressure out of the ranges set below.
th_th: แจ้งเตือนเมื่อความดันนอกช่วงตามข้างล่างนี้

# PhoneNumberDesc
source: The phone numbers that will be sent alerts. (Separate new numbers with commas , ).
th_th: เบอร์โทรศัพท์สำหรับแจ้งเตือน(แยกเบอร์ด้วย , )

# InvalidAlarmRange
source: Provided alarm range for systolic/diastolic blood pressure is invalid.
th_th: ค่าช่วงความดันไม่ถูกต้อง

# OverLabel
source: Over
th_th: มากกว่า

# UnderLabel
source: Under
th_th: น้อยกว่า

# SMSMessageSystolic
source: Systolic value = {0} (Range {1} - {2}).
th_th: ค่าความดันค่าสูง = {0} (ช่วง {1} ถึง {2}).

# SMSMessageDiastolic
source: Diastolic value = {0} (Range {1} - {2}).
th_th: ค่าความดันค่าต่ำ = {0} (ช่วง {1} ถึง {2}).

# DataEditIconLabel
source: Edit
th_th: แก้ไข

# DataDeleteIconLabel
source: Delete
th_th: ลบ
